<template>
    <div>
      <h3>当前版本1.0.7</h3>
      <div>
        <h4>版本号1.0.7</h4>
        <div>
          <p>修复：</p>
          <p>1.查看视频左上角编号显示错误</p>
          <p>2.后台-在线监控管理，去掉“设备名称”一列（已与产品确认）</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.6</h4>
        <div>
          <p>修复：</p>
          <p>1.修复预览视频因声音引起的卡顿</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.5</h4>
        <div>
          <p>更新：</p>
          <p>1.修改video-js.swf文件加载路径，为本地路径。</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.4</h4>
        <div>
          <p>更新：</p>
          <p>1.更新总览页面，显示角色权限；</p>
          <p>2.更新编辑用户组，用户名称和可配置账号数量限制，最大输入长度为10；</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.3</h4>
        <div>
          <p>修复：</p>
          <p>1.用户管理-查看用户列表增加分页监控画面闪动修复</p>
          <p>2.基本信息管理-编辑资料提示语错误监控视频窗口增加电量和设备名称显示</p>
          <p>3.”应用名“应改为”应用名称“</p >
          <p>4.服务管理-应用管理，批量删除应用后，页面没有自动刷新，已删除的数据依然显示</p >
          <p>5.后台-总览，名称后面加上性别标志</p>
          <p>6.后台-总览，必填的红色*和字体靠得太近,加上间距</p>
          <p>7.后台-总览-编辑资料，“用户名称”和“所属单位”做长度限制,20个字符</p>
          <p>8.后台-总览，文字“用户等级”改成“角色权限”</p>
          <p>9.后台-用户管理-用户组管理-添加或编辑用户组，数量输入框限制只能输入数字</p>
          <p>10.后台-用户管理-用户组管理-添加或编辑用户组，“用户组名称”和“可配置账号数量”要做长度限制</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.2</h4>
        <div>
          <p>更新：</p>
          <p>1.默认选择视频播放为1080p;</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.1</h4>
        <div>
          <p>完成：</p>
          <p>1.完成视频预览功能。</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.0</h4>
        <div>
          <p>1.完成监控后台相关功能。</p>
        </div>
      </div>
    </div>
</template>

<script>
    export default {
        name: "version"
    }
</script>

<style scoped>

</style>
