<template>
    <div>
      <h3>当前版本1.1.2</h3>
      <div>
        <h4>版本号1.1.2</h4>
        <div>
          <p>修复：</p>
          <p>1.用户中心-用户应用列表应用名称不显示</p>
        </div>
      </div>
      <div>
        <h4>版本号1.1.1</h4>
        <div>
          <p>修复：</p>
          <p>1.中台-监控列表-监控设备，远程控制设备时，要加上“远程控制时长”</p>
          <p>2.中台-监控列表-监控设备-发起远程控制，设备拒绝远程控制后，中台收到的提示应该显示“设备名”</p>
          <p>3.中台-监控列表-监控/查看设备，页面应该要显示“设备编号”</p>
          <p>4.中台-监控列表-离线列表，去掉“监控状态”和“监控客服”两列，加上“离线时间”一列</p>
          <p>5. 中台-监控列表-在线列表，状态“监控”改成“监控中”（筛选框也是改成“监控中”）</p>
          <p>6.中台-监控列表-在线列表，“监控客服”应该显示用户名称</p>
          <p>7.中台-监控平台-监控列表-离线列表，缺少“应用名称”一列</p>
          <p>8.新建用户-提示信息修改为“用户可使用手机号或邮箱作为登录帐号，默认密码为：邮箱+123”</p>
        </div>
      </div>
      <div>
        <h4>版本号1.1.0</h4>
        <div>
          <p>优化：</p>
          <p>1.sdk版本信息空白符、换行未显示</p>
          <p>1.应用管理-应用描述空白符、换行未显示</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.9</h4>
        <div>
          <p>修复：</p>
          <p>1.中台-监控平台-监控列表-点击监控-点击远程控制-眼镜端拒绝后，页面状态还是显示发起中</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.8</h4>
        <div>
          <p>修复：</p>
          <p>1. 中台-监控平台-监控列表-点击离线列表-再次点击在线列表-设备名称有误</p>
          <p>2. 中台-监控平台-监控列表-点击查看,名称为空</p>
          <p>3.中台-监控平台-监控列表-点击监控-点击远程控制-点击远程控制,显示错误</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.7</h4>
        <p>修复：</p>
        <p>1.修复查看视频不显示问题</p>
      </div>
      <div>
        <h4>版本号1.0.6</h4>
        <div>
          <p>修复：</p>
          <p>1.用户中心-只有查看权限的账号登录，基本信息管理还能编辑</p>
          <p>2.首页-只有查看权限的账号登录后，首页还能编辑</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.5</h4>
        <div>
          <p>优化：</p>
          <p>1.被监控设备进入监控页面后，会弹出提示，并且退出监控页面</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.4</h4>
        <div>
          <p>更新：</p>
          <p>1.更新video-js.swf文件加载方式，为本地路径。</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.3</h4>
        <div>
          <p>修复：</p>
          <p>1.中台-总览-编辑资料，用户名未做长度限制,限制输入20字符</p>
          <p>2.中台-总览-编辑资料，必填的红色*和字体靠得太近,增加间距</p>
          <p>3.监控列表，在线列表和离线列表缺少“设备名称”一列</p >
          <p>4.中台-监控平台-监控列表-离线列表，缺少以“应用名称”搜索的方式</p >
          <p>5.监控平台-监控列表-离线列表，缺少以“应用名称”搜索的方式</p >
          <p>6.监控视频窗口增加电量和设备名称显示</p >
          <p>7.监控画面闪动修复</p >
          <p>8.设备列表搜索关键字提示语修改</p>
          <p>9.用户中心-应用列表增加分页</p>
          <p>10.监控视频窗口增加电量和设备名称显示</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.2</h4>
        <div>
          <p>更新：</p>
          <p>1.默认选择视频播放为1080p;</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.1</h4>
        <div>
          <p>完成:</p>
          <p>1.完成视频预览功能。</p>
        </div>
      </div>
      <div>
        <h4>版本号1.0.0</h4>
        <div>
          <p>1.完成监控中台相关功能。</p>
        </div>
      </div>
    </div>
</template>

<script>
  import timer from '../share/timer'
    export default {
        name: "version",
        components:{
          timer
        }
    }
</script>

<style scoped>

</style>
